import clients from '../ui/assets/clients.jpg';
import customers from '../ui/assets/customers.jpg';
import quality from '../ui/assets/quality.jpg';
import tech from '../ui/assets/tech.jpg';

export default [
  {
    image: clients,
    texts: [
      'За годы работы постоянными клиентами компании стали крупнейшие предприятия нефтегазовой промышленности России и ближнего зарубежья.',
      'Мы признательны нашим клиентам и развиваемся вместе с ними. Мы делаем больше других, чтобы обеспечить максимальную выгоду для клиентов.',
    ],
  },
  {
    image: customers,
    texts: [
      'На заводе работают более сотни квалифицированных и грамотных сотрудников.',
      'Специалисты готовы выдать рекомендации, оптимальные решения по механической обработке, сборке, гидравлическим испытаниям и покраске Ваших изделий в желаемые сроки с подробным описанием и стоимостью материалов и услуг.',
    ],
  },
  {
    image: quality,
    texts: [
      'Система QR-кодирования позволяет получать полную информацию по любому изделию на каждом этапе его жизненного цикла.',
      'Мы используем материалы, испытанные по NACE TM0284 и NACE TM0177. Функционирует система менеджмента качества ГОСТ ИСО 45001-2020, ГОСТ Р ИСО 9001-2015, ГОСТ Р ИСО 14001-2016, СТО Газпром 9001-2018.',
    ],
  },
  {
    image: tech,
    texts: [
      'Мы используем реверсивные технологии на заводе. Наш инновационный подход к производству основан на использовании современных методов и оборудования для оптимизации процессов и повышения эффективности работы предприятия.',
    ],
  },
];
