import clients from '../ui/assets/clients.jpg';
import customers from '../ui/assets/customers.jpg';
import quality from '../ui/assets/quality.jpg';
import tech from '../ui/assets/tech.jpg';

export default [
  {
    image: customers,
    texts: [
      'Ценность компании не в оборудовании, а в людях. Мы — это прежде всего сплоченный коллектив квалифицированных специалистов. Мы ценим их профессионализм, ответственность и стремление к постоянному развитию, создавая условия для реализации их потенциала и карьерного роста.',
    ],
  },
  {
    image: clients,
    texts: [
      'Наша открытость и честность с нашими клиентами и партнерами позволяют нам ставить и реализоваться самые амбициозные цели, выполнять свою работу качественно и в срок, добросовестно реализовывать вверенные нам проекты, становиться лучше и не боятся брать на себя ответственность за принимаемые решения.',
    ],
  },
  {
    image: tech,
    texts: [
      'Мы предлагаем нашим клиентам широкий спектр сложного технологического оборудования. Осваиваем и внедряем новые технологии, связанные с применением новых современных материалов, которые позволят нам разрабатывать новые конструктивные решения для каждого элемента, детали, узла, входящего в состав трубопроводной арматуры, а также находить решения для работы в самых сложных условиях эксплуатации.',
    ],
  },
  {
    image: quality,
    texts: [
      'Благодаря своей гибкости к изменчивым условиям рынка и постоянному развитию, компания «ВАРК» имеет необходимый технический, кадровый и производственный потенциал, чтобы предложить своим клиентам качественную трубопроводную арматуру более современного конструктивного исполнения.',
    ],
  },
];
