export default {
  gazprom: [
    {
      name: 'Ишмухаметов Руслан Рагитович',
      position: 'Заместитель директора департамента',
      phone: '+7 (917) 770 77 82',
      email: 'Proekt@vark.ru',
    },
    {
      name: 'Валеев Азат Салаватович',
      position: 'Заместитель директора департамента по работе с ПАО «НОВАТЭК»',
      phone: '+7 (937) 480 16 91',
      email: 'ValeevAS@vark.ru',
    },
    {
      name: 'Ишмухаметов Руслан Рагитович',
      position: 'Заместитель директора департамента',
      phone: '+7 (917) 770 77 82',
      email: 'Proekt@vark.ru',
    },
    {
      name: 'Валеев Азат Салаватович',
      position: 'Заместитель директора департамента по работе с ПАО «НОВАТЭК»',
      phone: '+7 (937) 480 16 91',
      email: 'ValeevAS@vark.ru',
    },
  ],
  rosneft: [
    {
      name: 'Валеев Азат Салаватович',
      position: 'Заместитель директора департамента по работе с ПАО «НОВАТЭК»',
      phone: '+7 (937) 480 16 91',
      email: 'ValeevAS@vark.ru',
    },
  ],
  lukoil: [
    {
      name: 'Ишмухаметов Руслан Рагитович',
      position: 'Заместитель директора департамента',
      phone: '+7 (917) 770 77 82',
      email: 'Proekt@vark.ru',
    },
  ],
  sibur: [
    {
      name: 'Валеев Азат Салаватович',
      position: 'Заместитель директора департамента по работе с ПАО «НОВАТЭК»',
      phone: '+7 (937) 480 16 91',
      email: 'ValeevAS@vark.ru',
    },
  ],
};
