<template>
  <article class="block">
    <h3 class="h3 title">Наша цель</h3>
    <p>{{ aim }}</p>
  </article>
  <article class="block">
    <h3 class="h3 title">Наши принципы</h3>
    <ul class="principles">
      <li
        class="pr-item"
        v-for="pr in principles"
      >
        {{ pr }}
      </li>
    </ul>
  </article>
  <BaseButton class="btn">Читать полностью</BaseButton>
</template>

<script setup lang="ts">
  const aim = 'Разработка, выпуск и реализация конкурентоспособной продукции в установленные сроки, в заданных объемах, с уровнем качества, удовлетворяющим требованиям и ожиданиям наших потребителей и других заинтересованных сторон; обеспечение устойчивого экономического положения организации, здоровья и безопасности персонала с учетом минимального воздействия на экологическую обстановку.';
  const principles = [
    'Лидерство и ответственность на всех уровнях управления организации',
    'Каждый работник несет ответственность за качество продукции, охрану окружающей среды и безопасность своего труда, добросовестно выполняя свою работу',
    'Постоянное проведение мониторинга бизнес-среды Предприятия, применение риск-ориентированного подхода',
    'Повышение качества продукции и безопасности труда, снижение экологической нагрузки на окружающую среду является постоянной целью всех подразделений и сотрудников организации',
    'Каждый работник, выполняя свою работу на стадии производственного процесса, рассматривает работника на последующей операции, как своего потребителя.',
  ];
</script>

<style scoped lang="scss">
  .block {
    max-width: 1071px;
    @apply tw-text-body-m-regular;

    & + & {
      margin-top: 22px;
    }
  }

  .title {
    @apply tw-mb-10;
  }

  .principles {
    list-style: disc;
    padding-left: 20px;
  }

  .pr-item {
    & + & {
      @apply tw-mt-8;
    }
  }

  .btn {
    margin-top: 40px;
    background: #333333;
  }
</style>
