export default [
  {
    icon: 'capa',
    title: 'Мы за качество',
    text: 'Все поступающие материалы проходят входной контроль. Контролируем качество на каждом этапе производства',
  },
  {
    icon: 'secure',
    title: 'Надежность и открытость',
    text: 'В арматуростроении мы с 2007 года. Всегда открыты для визитов нашего производства и личной приемки заказа клиентами',
  },
  {
    icon: 'revers',
    title: 'Индивидуальный подход',
    text: 'Формируем индивидуальное техническое предложение для Заказчика в полной мере отвечающие предъявляемым требованиям и ожиданиям',
  },
  {
    icon: 'apps',
    title: 'Реверс технологий',
    text: 'Производим качественное высокотехнологичное оборудование. Уход импортного оборудования теперь не проблема',
  },
];
