export default [
  {
    icon: 'capa',
    title: 'Мы за качество',
    text: 'Все поступающие материалы проходят входной контроль. Контролируем качество на каждом этапе производства',
  },
  {
    icon: 'secure',
    title: 'Надежность и открытость',
    text: 'В арматуростроении мы с 2007 года. Всегда открыты для визитов нашего производства и личной приемки заказа клиентами',
  },
  {
    icon: 'capa',
    title: 'Надежность и открытость',
    text: 'В арматуростроении мы с 2007 года. Всегда открыты для визитов нашего производства и личной приемки заказа клиентами',
  },
];
